Revit 2024 API
FabricationService.GetPaletteName Method
 Gets the name of a palette based on palette index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public string GetPaletteName(
	int palette
)
Visual Basic
Public Function GetPaletteName ( _
	palette As Integer _
) As String
Visual C++
public:
String^ GetPaletteName(
	int palette
)
Parameters
palette
Type: System.Int32
 The index of the palette.
Return Value
 The name of the palette.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The index palette is not larger or equal to 0 and less than PaletteCount.
See Also
FabricationService Class
Autodesk.Revit.DB Namespace